БухЭксп/InformationRegisters/CW_Переводы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_Переводы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Перевод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектПеревода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыПереводов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>600</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ПереводыСервер/Ext/Module.bsl
// Функция - Получить переводы
//
// Параметры:
//  ОбъектПеревода	 - 	 ссылка на объект перевода 
//  ИмяРеквизита	 - 	 имя реквизита объекта перевода 
//  ЯзыкиПеревода	 - 	 Массив со ссылками справочника CW_Языки или строка кодов языка, разделенная запятыми
// 
// Возвращаемое значение:
//   -  Соответствие, где ключ - язык (ссылка на справочник CW_Языки), значение - значение перевода
//
Функция ПолучитьПереводы(ОбъектПеревода, ИмяРеквизита="", ЯзыкиПеревода="") Экспорт
	
	Если ТипЗнч(ЯзыкиПеревода) = Тип("Строка")
		и Не ПустаяСтрока(ЯзыкиПеревода) Тогда
		ЯзыкиПеревода = ПолучитьЯзыкиПереводаИзСтроки(ЯзыкиПеревода);
	КонецЕсли; 
	
	Если ТипЗнч(ЯзыкиПеревода) <> тип("Массив") Тогда
		ЯзыкиПеревода = ПолучитьДоступныеЯзыкиПеревода();
	КонецЕсли;
	
	Переводы = Новый Соответствие;
	
	Для каждого ЯзыкПеревода Из ЯзыкиПеревода Цикл 
		Перевод = ПолучитьПеревод(ОбъектПеревода, ИмяРеквизита, ЯзыкПеревода);
		
		Переводы.Вставить(ЯзыкПеревода, 			Перевод);
		Переводы.Вставить(СокрЛП(ЯзыкПеревода.Код), Перевод);
	КонецЦикла; 
	
	Возврат Переводы;
	
КонецФункции

// Функция - Получить перевод
//
// Параметры:
//  ОбъектПеревода	 - 	 ссылка на объект перевода 
//  ИмяРеквизита	 - 	 имя реквизита объекта перевода 
//  ЯзыкПеревода	 - 	 язык перевода - ссылка справочника CW_Языки или строка(код языка)
// 
// Возвращаемое значение:
//   -  Возвращает значение перевода для указанного языка
// 
Функция ПолучитьПеревод(ОбъектПеревода, ИмяРеквизита="", ЯзыкПеревода) Экспорт  
	
	Если ТипЗнч(ЯзыкПеревода) = Тип("Строка")
		и Не ПустаяСтрока(ЯзыкПеревода) Тогда
		ЯзыкПеревода = Справочники.CW_Языки.НайтиПоКоду(НРег(ЯзыкПеревода));	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ЯзыкПеревода) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_Переводы.Язык КАК Язык,
	|	CW_Переводы.Перевод КАК Перевод
	|ИЗ
	|	РегистрСведений.CW_Переводы КАК CW_Переводы
	|ГДЕ
	|	CW_Переводы.ОбъектПеревода = &ОбъектПеревода
	|	И CW_Переводы.Реквизит = &Реквизит
	|	И CW_Переводы.Язык = &Язык";
	
	Запрос.УстановитьПараметр("ОбъектПеревода", ОбъектПеревода);
	Запрос.УстановитьПараметр("Реквизит", 		ИмяРеквизита); 
	Запрос.УстановитьПараметр("Язык", 			ЯзыкПеревода); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Перевод);  
	КонецЕсли; 
	
	Если Не ПустаяСтрока(ИмяРеквизита) Тогда
		Шаблон = "ОбъектПеревода."+СокрЛП(ИмяРеквизита);
		Возврат Вычислить(Шаблон);	
	КонецЕсли;
	
	Возврат СокрЛП(ОбъектПеревода);
	
КонецФункции 

// Процедура - Записать перевод
//
// Параметры:
//  ПараметрыПеревода	 - 	структура 
//
Процедура ЗаписатьПеревод(ПараметрыПеревода) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_Переводы.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.ОбъектПеревода = ПараметрыПеревода.ОбъектПеревода;
	ЗаписьРегистра.Реквизит = ПараметрыПеревода.Реквизит;
	ЗаписьРегистра.Язык = ПараметрыПеревода.Язык;
	ЗаписьРегистра.Перевод = ПараметрыПеревода.ЗначениеПеревода;   
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

// Функция - Получить доступные языки перевода
// 
// Возвращаемое значение:
//   - Массив
//
Функция ПолучитьДоступныеЯзыкиПеревода() Экспорт
	
	ЯзыкиПеревода = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	CW_Языки.Ссылка КАК Язык
	|ИЗ
	|	Справочник.CW_Языки КАК CW_Языки
	|ГДЕ
	|	CW_Языки.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	Пока Выборка.Следующий() Цикл
		ЯзыкиПеревода.Добавить(Выборка.Язык);
	КонецЦикла; 
	
	Возврат ЯзыкиПеревода;
	
КонецФункции

// Функция - Получить языки перевода из строки
//
// Параметры:
//  ЯзыкиПеревода	 - 	 строка с кодами языка, разеленными запятыми 
// 
// Возвращаемое значение:
//   - массив со ссылками справочник.CW_Языки
//
Функция ПолучитьЯзыкиПереводаИзСтроки(Знач ЯзыкиПеревода)

	мЯзыкиПеревода = СтрРазделить(ЯзыкиПеревода, ","); 

	ЯзыкиПеревода = Новый Массив;
	Для каждого кодЯзыка из мЯзыкиПеревода Цикл 
		Язык = Справочники.CW_Языки.НайтиПоКоду(НРег(кодЯзыка));	
		Если Язык.Пустая() 
			или  ЯзыкиПеревода.Найти(Язык) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЯзыкиПеревода.Добавить(Язык);	
	КонецЦикла; 
	
	Возврат ЯзыкиПеревода;

КонецФункции
